{"schedule":{"version":"1.1","base_url":"https://www.luga.de/Aktionen/LIT-2018/Programm","conference":{"acronym":"LIT2018","title":"17. Augsburger Linux-Infotag ","start":"2018-04-21","end":"2018-04-21","daysCount":1,"timeslot_duration":"00:05","days":[{"index":1,"date":"2018-04-21","day_start":"2018-04-21T09:00:00+02:00","day_end":"2018-04-21T18:00:00+02:00","rooms":{"Raum A":[{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/9.html","id":9,"guid":"4e60924b-785a-4240-be31-80c7ab326e8d","logo":null,"date":"2018-04-21T09:40:00+02:00","start":"09:40","duration":"00:45","room":"Raum A","slug":"LIT2018-9-das_internet_der_unsicheren_dinge","title":"Das Internet der unsicheren Dinge","subtitle":"","track":"Digitale Gesellschaft","type":"lecture","language":"de","abstract":"Euch erwarten aktuelle Beispiele aus dem Jahr 2018 von Datenschutz- und IT-Sicherheitsversagen aus dem Bereich Internet der Dinge (IoT), die ich im Zuge meiner Arbeit als Journalistin sammle. Was bedeutet ein Internet der unsicheren Dinge für die Gesellschaft? Was bedeutet es für unsere Privatsphäre? Und - was für Alternativen gibt es?","description":"Das Internet der Dinge (IoT) wächst. Viele Netzbetreiber sprechen vom \"next big thing“, einer Welt der smarten „Always-On“-Geräte. Bis jetzt ist IoT aber eher eine breite Palette von Katastrophenplots mit vielen Sicherheits- und Datenschutzproblemen, die eine Gefahr für das Internet darstellen.\r\n\r\nEin Beispiel: Einige EU-Länder (darunter Deutschland) haben 2017 vernetzte Spielzeugpuppen verboten, weil diese durch eingebaute Mikrofone zur Wanze werden. Auch digitale Assistenten wie Amazon Echo oder Google Home wurden bereits gehackt. IT-Experten fordern daher bessere Sicherheitsstandards.\r\n\r\nEin anderes Beispiel: 2018 hat in den USA der erste Internet-Provider damit gedroht, dass auch vernetzte Thermostate und Überwachungskameras nicht mehr funktionieren würden, wenn die Internet-Verbindung aufgrund von Urheberrechtsverletzungen gedrosselt wird. Provider sind dort aufgrund der Aufhebung der Netzneutralitätsgesetze in der Lage, Internetverbindungen zu reduzieren.\r\n\r\nEin weiteres Problem betrifft etwa die Tatsache, dass gewisse Produkte ohne Internet-Verbindung gar nicht mehr funktionieren. Doch was ist, wenn die dazugehörige Firma plötzlich bankrott geht? So werden etwa 2018 beim Start-up Amberlight die Lichter ausgehen. Das Start-up ist pleite, die Dienste abgedreht. Damit die smarten Sockel der Firma funktionieren, wird aber eine permanente Cloud-Verbindung zu den Firmenservern benötigt. Die Kunden sitzen nun im Dunkeln. \r\n\r\nEs mag bequem sein, mit einer App das Licht im Wohnzimmer zu dimmen, mit einem Button Klopapier bei Amazon nachzubestellen, oder sich von Alexa den Wetterbericht vorlesen zu lassen. Doch die Bequemlichkeit hat ihren Preis. Das „Internet der Dinge“, das eine immer größere Vernetzung in den Alltag bringt, gefährdet unsere Privatsphäre. \r\n\r\nAber was können wir als Gesellschaft tun? Wir können die Entwicklung nicht stoppen, aber wir können Produkte sicherer machen und bessere Regeln dafür schaffen. Derzeit kümmern sich die Hersteller von IoT-Produkten in erster Linie um ihre Geschäft. Sie wollen ihre Produkte so schnell wie möglich auf den Markt bringen, die Sicherheit bleibt hier auf der Strecke. In meinem Vortrag möchte ich einige Beispiele zeigen und erklären, warum dies für uns alle zum Problem wird und wie ein Mix aus Regulierung, Kunden-Rebellion und Alternativen helfen könnte.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":13,"public_name":"Barbara Wimmer"}],"links":[{"url":"https://youtu.be/euNRztv4Ubk","title":"Video"}],"attachments":[{"url":"/system/event_attachments/attachments/000/000/007/original/Das_Internet_der_unsicheren_Dinge_Talk_Deutsch.pdf?1546163258","title":"Vortragsfolien PDF"},{"url":"/system/event_attachments/attachments/000/000/027/original/Das_Internet_der_unsicheren_Dinge_Talk_Deutsch.pptx?1546163263","title":"Vortragsfolien PowerPoint"},{"url":"/system/event_attachments/attachments/000/000/028/original/Das_Internet_der_unsicheren_Dinge_Talk_Deutsch_mit_Notizen.pdf?1546163263","title":"Vortragsfolien mit Kommentar"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/18.html","id":18,"guid":"37452da1-7584-4fc3-8651-b48da5e37df1","logo":"/system/events/logos/000/000/018/large/MixedMode_Logo_CMYK.jpg?1546163252","date":"2018-04-21T10:45:00+02:00","start":"10:45","duration":"00:45","room":"Raum A","slug":"LIT2018-18-iot_security-check","title":"IoT SECURITY-Check","subtitle":"Wie Sie Bedrohungen rechtzeitig erkennen ","track":"Privatsphäre und Sicherheit","type":"lecture","language":"de","abstract":"Die zunehmende Vernetzung von Kleinstgeräten ermöglicht die Entwicklung von in der Vergangenheit undenkbaren vernetzten Systemen. Neben den neuen Möglichkeiten birgt dies aber auch viele neue Gefahren. Vor allem Bereiche, die vorher durch fehlende Schnittstellen nach Außen als relativ sicher galten, sehen sich nun mit Fragestellungen der IT-Sicherheit konfrontiert. Der Vortrag zeigt am Beispiel einer Heimnetzwerks auf, wie eine solche Bedrohungsanalyse durchgeführt wird und damit Gefahren sowie mögliche Schwachstellen identifiziert werden können.","description":"Die zunehmende Vernetzung von Kleinstgeräten ermöglicht die Entwicklung von in der Vergangenheit undenkbaren vernetzten Systemen. Neben den neuen Möglichkeiten birgt dies aber auch viele neue Gefahren. Vor allem Bereiche, die vorher durch fehlende Schnittstellen nach Außen als relativ sicher galten, sehen sich nun mit Fragestellungen der IT-Sicherheit konfrontiert. Der Vortrag zeigt am Beispiel einer Heimnetzwerks auf, wie eine solche Bedrohungsanalyse durchgeführt wird und damit Gefahren sowie mögliche Schwachstellen identifiziert werden können.\r\nDer Referent Michael Schnelle besitzt einen Abschluss als Master in Software-Engineering. Mittlerweile verfügt er über mehrere Jahre Entwicklungserfahrung mit den Schwerpunkten (Web-)Applikationsentwicklung und „Security“ in unterschiedlichen Schattierungen. Unter anderem führte er dabei Risikoanalysen durch, entwickelte Lösungen zur Abwehr schadhafter Anfragen auf einer Socialmedia-Plattform, für ein hochsicheres Signalisierungssystems für Notrufeinheiten, sowie zur Generierung einer sicheren Linux/ Debian-Distribution. In seinem aktuellen Projekt wirkt er bei der Entwicklung von Fahrgastinformations-Systemen für Verkehrsunternehmen mit, mit den Schwerpunkten verteilte Systeme, Microservices und Testautomatisierung. \r\n","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":36,"public_name":"Michael Schnelle"}],"links":[{"url":"https://youtu.be/rFE3e6ZAFMY","title":"Video"}],"attachments":[{"url":"/system/event_attachments/attachments/000/000/030/original/Michael-Schnelle.Security-Check-LUGA.pdf?1546163263","title":"Vortragsfolien"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/19.html","id":19,"guid":"88e34a4d-6aa3-424b-8d25-9c1e9f0b317a","logo":null,"date":"2018-04-21T11:45:00+02:00","start":"11:45","duration":"00:45","room":"Raum A","slug":"LIT2018-19-einsatz_von_ssh_zum_aufbau_eines_sicheren_netzes","title":"Einsatz von SSH zum Aufbau eines sicheren Netzes","subtitle":"","track":"Privatsphäre und Sicherheit","type":"lecture","language":"de","abstract":"SSH, Secure Shell, wird oft auf die reine Funktion eines sicheren Zugriffs per Terminal reduziert. SSH kann aber viel mehr. Sieht man SSH als einen sicheren Kanal an, über den man fast beliebig Daten senden kann und der eine sichere Punkt zu Punkt Verbindung zwischen zwei Rechnern aufbaut, wird man dem Umfang der Möglichkeiten eher gerecht.\r\n","description":"Im Detail wird gezeigt:\r\nInstallation und Einrichtung von SSH.\r\nEine simple, sichere Verbindung zu einem SSH Server, mit Passwort und ohne Passwort über Schlüssel. \r\nSichere Verbindung zu PCs, die kein SSH können.\r\nTunnel für beliebige Ports, dem X-Protokoll, dem Remote-Desktop mit X2Go, HTTP. \r\nRemote Zugriff auf einen Windows-PC mit dem Remote-Desktop-Protokoll.\r\nDieses wird über SSH 'getunnelt'. \r\nZugriff auf einen PC hinter einem Router/Firewall mit Reverse SSH.\r\nDatensicherung über unsichere, instabile Netze.  \r\nAbschätzung des minimalen CPU Aufwandes zum Entschlüsseln einer Verbindung ohne Kenntnis des Schlüssels/Passwortes, um die Sicherheit von SSH zu zeigen.\r\nuvam.\r\n","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":21,"public_name":"Richard Albrecht"}],"links":[{"url":"http://www.kilux.de/index.php?seite=programm.html\u0026untermenu=Besucher-Info#314","title":"Vortrag zur 'Kielux' 2017 in Kiel"},{"url":"https://www.lug-ottobrunn.de/wiki/Kieler_Open_Source_und_Linux_Tage_2017","title":"Link zum PDF bei der LUG-Ottobrunn"},{"url":"https://youtu.be/oEqpcQ2dEuE","title":"Video"}],"attachments":[{"url":"/system/event_attachments/attachments/000/000/032/original/LIT_2018_SSH_Vortrag.pdf?1546163264","title":"Folien"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/4.html","id":4,"guid":"b2a7bd5a-8a48-49e6-8bc2-521c0533ee43","logo":"/system/events/logos/000/000/004/large/ciphermail.png?1546163249","date":"2018-04-21T13:15:00+02:00","start":"13:15","duration":"00:45","room":"Raum A","slug":"LIT2018-4-e-mail_encryption_gateway_ciphermail","title":"E-Mail Encryption Gateway CipherMail","subtitle":"","track":"Privatsphäre und Sicherheit","type":"lecture","language":"de","abstract":"CipherMail ist ein zentraler Mail Transfer Agent (MTA), der nach dem \"store and forward\" Prinzip arbeitet: Eingehende E-Mails, gleichgültig ob von intern oder extern, werden nur so lange gespeichert, bis sie ver- oder entschlüsselt wurden und an die Bestimmungsadresse weitergeleitet werden können. Dies geschieht ohne eine Änderung am E-Mail-Client!","description":"Emails werden zumeist im Klartext verschickt. Das bedeutet, dass jeder der Zugriff auf den Datenstrom hat, den Inhalt der Emails lesen kann. Dies ist inzwischen für die meisten Unternehmen, Institutionen und Organisationen inakzeptabel und verstößt gegebenenfalls auch gegen geltendes Recht. Emails müssen daher vertraulich sein und verschlüsselt werden.\r\n\r\nCiphermail ist ein zentraler Mail Transfer Agent (MTA), der nach dem \"store and forward\" Prinzip arbeitet: Eingehende Emails, gleichgültig ob von intern oder extern, werden nur so lange gespeichert, bis sie ver-/entschlüsselt wurden und an die Bestimmungsadresse weitergeleitet werden können. Dies geschieht ohne eine Änderung am E-Mail-Client!\r\n\r\nDie Software unterstützt die Verschlüsselung mittels PGP, SMIME und PDF, kann unter anderem eine eigene Certificate Authority (CA) betreiben und läßt sich vollständig über ein Webinterface administrieren. Natürlich gehören auch eine fallweise Verschlüsselung mittels Trigger, Data Lead Prevention (DLP), sowie ein automatisches Backup und ein umfangreiches Logging zum Funktionsumfang.\r\n\r\nDer Vortrag beginnt mit einer kurzen Darstellung der Gründe, die von Unternehmen aktuell gegen den Einsatz von E-Mail-Verschlüsselung angeführt werden. Im Anschluss werden die Installationsmöglichkeiten und die Funktionen der Software dargestellt. Im dritten Teil wird anhand eines Live-Systems ein Einblick in die Konfiguration von CipherMail gegeben.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":9,"public_name":"Stefan Günther"}],"links":[{"url":"https://www.ciphermail.info","title":"E-Mail Encryption Gateway CipherMail"},{"url":"https://youtu.be/sU_uoUFSQkI","title":"Video"}],"attachments":[{"url":"/system/event_attachments/attachments/000/000/031/original/CipherMail-Praesentation.pdf?1546163264","title":"Folien"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/23.html","id":23,"guid":"069da68f-dd39-4cfc-b277-b95af38664ff","logo":null,"date":"2018-04-21T14:15:00+02:00","start":"14:15","duration":"00:45","room":"Raum A","slug":"LIT2018-23-von_uberall_her_per_tor_auf_seinen_rechner_gelangen","title":"Von überall her per Tor auf seinen Rechner gelangen","subtitle":"Tor als kostenloses, öffentliches \"VPN\" um NAT zu durchdringen","track":"Privatsphäre und Sicherheit","type":"lecture","language":"de","abstract":"Tor ist nicht nur etwas für investigative Journalisten, Whistleblower, auf Privatsphäre achtende Webnutzer oder böse Jungs. Man kann es auch als leicht einzurichtendes, öffentliches \"VPN\" nutzen um durch einen NAT-Router hindurch auf eigene Dienste zuzugreifen.\r\n\r\nDieser Vortrag soll anhand einer Live-Demonstration auf einem Raspberry Pi zeigen, wie man einen Webserver und SSH-Zugriff per Tor konfiguriert und darauf zugreift.","description":"Welcher Linuxer oder Raspberry-Pi-Besitzer kennt das nicht: Man hat zuhause einen kleinen, selbst-administrierten Server stehen, den man gerne auch von unterwegs oder für Freunde erreichbar haben will. Aber zuhause gibt's nur eine IPv4-Adresse — die des Routers.\r\n\r\nWill man solch einen Server oder Raspberry Pi trotzdem vom Internet aus erreichbar machen, muss man einiges konfigurieren: Der Rechner braucht eine feste IP innerhalb des Heimnetzes, es braucht eine Port-Weiterleitung vom NAT-Router auf diesen Rechner und falls mal die\r\nvom ISP zugewiesene IP-Adresse ändert (Stichwort \"Zwangstrennung\"), muss den Rechner bei einem Anbieter für dynamisches DNS anmelden und einen Cron-Job einrichten, der sich regelmäßig dort meldet und gegebenenfalls die IP-Adresse des DNS-Eintrags aktualisiert.\r\n\r\nWenn man Pech hat, dann geht nicht einmal das, weil immer mehr ISPs aufgrund von Adressknappheit sogenanntes \"Carrier-Grade NAT\" einsetzen, d.h. selbst der heimische NAT-Router hat keine öffentliche IPv4-Adresse sondern sitzt selbst nochmals hinter einem oder mehreren weiteren NAT-Routern beim ISP. Und dort bekommt man keine Port-Weiterleitungen.\r\n\r\nWill man das Problem mit einem klassischen VPN umgehen, so braucht man mindestens noch einen zweiten normal erreichbaren Server im Internet oder man mietet sich ein VPN-Zugang bei einem der zahlreichen Anbieter.\r\n\r\nEs geht aber auch günstiger und einfacher, ohne DynDNS und ohne Router-Konfigurieren. Das weltweite und für jedermann kostenlos verfügbare Anonymisierungsnetzwerk Tor ermöglicht u.a. auch das Einrichten von sogenannten versteckten Diensten (engl. \"Hidden Services\"). Einen solchen \"HIdden Service\" kann man leicht einrichten und dann von überall her über das Tor-Netzwerk auf seine Daten zugreifen.\r\n\r\nDieser Vortrag soll anhand einer Live-Demonstration auf einem Raspberry Pi zeigen, wie man einen Webserver und SSH-Zugriff per Tor konfiguriert und nutzen.\r\n\r\nUm nicht zu verraten, wo ein Rechner wirklich steht (was nicht selten der Grund für einen Hidden Service ist), braucht es allerdings nochmals eine ganze Ladung mehr Einstellungen. Darauf geht der Vortrag bewusst nicht ein, da der Fokus des Vortrages auf Erreichbarkeit und nicht auf Anonymität liegt.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":25,"public_name":"Axel Beckert"}],"links":[{"url":"https://noone.org/talks/tor/","title":"Folien zum Vortrag"},{"url":"https://youtu.be/BS3F6-IEvCg","title":"Video"}],"attachments":[]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/7.html","id":7,"guid":"67e52166-a325-4616-bc60-051a96402009","logo":"/system/events/logos/000/000/007/large/vertical_white_shadow.png?1546163249","date":"2018-04-21T15:15:00+02:00","start":"15:15","duration":"00:45","room":"Raum A","slug":"LIT2018-7-i2p_-_k_eine_alternative_zu_tor","title":"I2P - (k)eine Alternative zu Tor","subtitle":"Was ist I2P, was kann es, was kann es nicht","track":"Privatsphäre und Sicherheit","type":"lecture","language":"de","abstract":"Nahezu jeder kennt Tor, doch kaum einer kennt die Alternativen. Ich stelle hier I2P detailliert vor","description":"Dieser Vortrag beschäftigt sich mit dem Low-Latency Anonymous Network I2P, welches eine Alternative zu Tor ist, jedoch weniger bekannt ist und einen anderen Schwerpunkt legt. Ich stelle die grundsätzliche Fnktionsweise dar, die Möglichkeiten, die vorhandenen Anwendungen und die Limits des Netzwerkes.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":11,"public_name":"Lars Schimmer"}],"links":[{"url":"https://geti2p.net","title":"I2P Webseite"},{"url":"https://youtu.be/SAYOAMcQQ2w","title":"Video"}],"attachments":[{"url":"/system/event_attachments/attachments/000/000/005/original/2018.augsburg.I2PKEineAlternativezuTor.pdf?1546163258","title":"2018.augsburg.I2PKEineAlternativezuTor.pdf"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/27.html","id":27,"guid":"2fe75070-9863-43e8-882c-3eac5769fce9","logo":null,"date":"2018-04-21T16:15:00+02:00","start":"16:15","duration":"00:45","room":"Raum A","slug":"LIT2018-27-seitenkanalangriffe_verstandlich_erklart","title":"Seitenkanalangriffe verständlich erklärt","subtitle":"Spectre und Meltdown sind nur die Spitze des Eisbergs","track":"Privatsphäre und Sicherheit","type":"lecture","language":"de","abstract":"Spectre und Meltdown haben Seitenkanalangriffe auf recht dramatische Art und Weise in der Öffentlichkeit bekannt gemacht. In diesem Vortrag werden Seitenkanalangriffe allgemein verständlich und anhand von Beispielen und Demos erklärt.","description":"Wenn im Wasserwerk plötzlich der Druck stark abfällt ist entweder irgendwo ein wichtiges Rohr gebrochen, oder es ist Halbzeitpause in einem Deutschlandspiel. In letzterem Fall haben wir einen Seitenkanal der eine (zugegebenermaßen nicht sonderlich interessante) Information transportiert.\r\nDigitale Elektronik wie sie in Computern, Mikrocontrollern usw. verbaut wird benötigt elektrischen Strom. Und hier wird es interessant, denn die Leistungsaufnahme eines solchen Systems ist abhängig von den Daten, die verarbeitet werden. Eine Messung der Leistungsaufnahme erlaubt also Rückschlüsse auf die Daten. Diese \"Power Analysis\" genannte Angriffsklasse lässt sich beispielsweise nutzen, um geheime Schlüssel aus Mikrocontrollern zu extrahieren. Wie das genau funktioniert wird im Vortrag mit einer Demo gezeigt.\r\nNeben der Leistungsaufnahme gibt es noch weitere Seitenkanäle. Beispielsweise elektromagnetische Abstrahlung und die Ausführungszeit einer Datenverarbeitung. Wertet man die Ausführungszeit aus, so spricht man von timing-Angriffen. Spectre und Meltdown sind solche timing-Angriffe. Das perfide an diesen Angriffen ist, dass sie sich auch aus der Ferne, also beispielsweise über ein Netzwerk, durchführen lassen. Im Vortrag werden wir (wieder mithilfe von Beispielen und Demos) sehen, dass nicht nur Spectre und Meltdown (temporäre) Probleme sind. Timing-Angriffe stellen insgesamt ein viel größeres Problem dar, als man auf den ersten Blick sieht. Daher stellt sich natürlich die Frage nach möglichen Gegenmaßnahmen. Auch Gegenmaßnahmen und die Grenzen dieser Ansätze werden im Vortrag aufgezeigt und mit Beispielen veranschaulicht.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":19,"public_name":"Hunz"}],"links":[],"attachments":[{"url":"/system/event_attachments/attachments/000/000/024/original/lit18_sca.pdf?1546163263","title":"slides"}]}],"Raum B":[{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/14.html","id":14,"guid":"5c32edb7-867e-4e04-bf21-ca42f2de5b85","logo":"/system/events/logos/000/000/014/large/open-source.jpg?1546163252","date":"2018-04-21T10:45:00+02:00","start":"10:45","duration":"00:45","room":"Raum B","slug":"LIT2018-14-mitmachen_bei_open_source_projekten","title":"Mitmachen bei Open Source Projekten","subtitle":"Wie funktionieren Open Source Projekte und wie kann jeder mitmachen.","track":"Digitale Gesellschaft","type":"lecture","language":"de","abstract":"Ich möchte live bei einigen Open Source Projekten kleine Änderungen einreichen. Dabei werden wir nicht nur Seiten wie github.com nutzen, sondern auch schauen, wie das bei größeren Projekten wie dem Linux Kernel funktionieren würde.","description":"Die Welt der Open Source Software ist groß, sehr groß. Die Spitze des Eisbergs besteht aus Projekten wie z.B. GNU/Linux, Libreoffice oder Gimp. Aber die meisten Projekte sind sehr klein und unbekannt.\r\nJe nach größe haben diese Projekte unterschiedliche Verfahren um beitragen zu können. Mache nutzen github.com, andere Mailinglisten.\r\nWir wollen schauen wie das zu nutzen ist um selber Verbesserungen beizutragen oder auch selber ein Projekt zu gründen. Die Veranstaltung richtet sich an Linux-Anfänger, die vielleicht schon einmal die Konsole gesehen haben.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":16,"public_name":"Moritz Warning"}],"links":[{"url":"https://youtu.be/0uG5Ps7wdfU","title":"Video"}],"attachments":[{"url":"/system/event_attachments/attachments/000/000/020/original/oos_linux_info_tag_2018.pdf?1546163262","title":"Vortragsfolien PDF"},{"url":"/system/event_attachments/attachments/000/000/025/original/oos_linux_info_tag_2018.odp?1546163263","title":"Vortragsfolien ODP"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/5.html","id":5,"guid":"f7fe4f17-a340-4b0b-a9c6-6f9a2d5a6b93","logo":null,"date":"2018-04-21T11:45:00+02:00","start":"11:45","duration":"00:45","room":"Raum B","slug":"LIT2018-5-open_data_in_sudafrika","title":"Open Data in Südafrika","subtitle":"","track":"Digitale Gesellschaft","type":"lecture","language":"de","abstract":"Wie intensiv wird Open Data in Südafrika genutzt? Ein Erfahrungsbericht","description":"Open Data bezeichnet das Bereitstellen erfasster Daten für die Öffentlichkeit. Wir führen in die Thematik ein und berichten, wie stark das in Südafrika genutzt wird und für alle zur Verfügung steht.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":10,"public_name":"Frank Hofmann"}],"links":[{"url":"https://youtu.be/MuqfyTYEKaQ","title":"Video"}],"attachments":[]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/16.html","id":16,"guid":"b48969f8-2178-4e16-904c-73f24fee3259","logo":null,"date":"2018-04-21T13:15:00+02:00","start":"13:15","duration":"00:45","room":"Raum B","slug":"LIT2018-16-libreoffice_was_wir_tun_wohin_wir_gehen_und_mitmachen","title":"LibreOffice: Was wir tun, wohin wir gehen – und mitmachen!","subtitle":"","track":"Digitale Gesellschaft","type":"lecture","language":"de","abstract":"Was ist LibreOffice? Woher kommt es? Wohin geht es? Welche Erfolge haben wir genossen, und welche Hindernisse stehen vor uns? Wie könnt ihr mitmachen – und was lernt ihr dabei? Was wollt ihr sonst wissen? Wir anworten alles!","description":"","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":18,"public_name":"Mike Saunders"}],"links":[],"attachments":[{"url":"/system/event_attachments/attachments/000/000/016/original/LibreOffice_Hinter_-_Was__Wohin__Mitmachen.pdf?1546163262","title":"Vortrag: Was wir tun, wohin wir gehen – und mitmachen!"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/22.html","id":22,"guid":"d149f475-9d0c-4b32-b0f4-5855af5d72bd","logo":null,"date":"2018-04-21T14:15:00+02:00","start":"14:15","duration":"00:45","room":"Raum B","slug":"LIT2018-22-sieben_brucken","title":"Sieben Brücken","subtitle":"Fahrtenbuch mit Skripten auslesen","track":"Linux-Interna und Anwendungen","type":"lecture","language":"de","abstract":"","description":"Computer wurden ursprünglich als Rechenmaschinen entwickelt. Am Beispiel eines Fahrtenbuchs zeigen wir, wie Sie mit Bordmitteln das Maschinchen zu Ihren Gunsten werkeln lassen. Dabei stellen wir Ihnen sieben clevere Varianten der Problemlösung für die Kommandozeile vor.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":10,"public_name":"Frank Hofmann"}],"links":[],"attachments":[]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/30.html","id":30,"guid":"3aab1286-f50b-4b1f-be49-70c126c77c8d","logo":"/system/events/logos/000/000/030/large/osi_symbol.png?1546163255","date":"2018-04-21T15:15:00+02:00","start":"15:15","duration":"00:45","room":"Raum B","slug":"LIT2018-30-open-source_der_weg_aus_der_abhangigkeit_von_microsoft","title":"Open-Source: der Weg aus der Abhängigkeit von Microsoft","subtitle":"Schützt euch und eure liebsten (Daten)","track":"Digitale Gesellschaft","type":"lecture","language":"de","abstract":"Es kann nur einen Weg geben, sich aus dem Quasi-Monopol weniger Marktteilnehmer zu lösen: Alternativen zu nutzen. Selbstverständlich ist es einfacher nach dem Prinzip zu leben \"Nobody get fired for buying Microsoft\", allerdings begibt man sich strategisch in eine Richtung, in der man zum Schluss wenig Wahlmöglichkeiten und Flexibilität hat. Dieser Vortrag zeigt anhand von 3 (prominten) Beispielen aus erster Hand, wie Organisationen nicht bequem waren, sondern sich aktiv um alternativen kümmerten. Der Lohn von geringeren Kosten, wesentlich höhere Flexibilität und gleichzeitig einer besseren Abbildung der organisatorischen Bedürfnisse lässt sich nicht nur erfühlen, sondern aktiv belegen. Open Source Produkte die in diesem Beispielen zum Einsatz kamen sind: Univention, Mattermost \u0026 Kopano.","description":"Eine Gruppe europäischer Journalisten hat Europas Behörden und Regierungen eine „fatale Abhängigkeit von Microsoft“ diagnostiziert. Ihre Recherchen belegen am Beispiel von Microsoft Office eine Kette von Abhängigkeiten zu nur diesem einen Konzern. Sie beschreiben auch, wie einige Behörden durch den Einsatz von LibreOffice bereits aus dieser Abhängigkeit ausbrechen konnten.\r\n\r\nEin wichtiger Bestandteil von Microsoft Office ist Outlook. Doch speziell in Outlook sind die Abhängigkeiten von anderen Microsoft-Lösungen größer denn je, sobald man gemeinsam mit E-Mails oder Kalendern arbeiten möchte.\r\n\r\nWebbasierte Applikationen – Der Trend zur Unabhängigkeit\r\n\r\nUnternehmen und Anwender versuchen der Abhängigkeit zu entkommen, in der ein zentrales Produkt wie Outlook nur mit Diensten eines Herstellers – nämlich dem Microsoft Exchange Server oder Microsoft Office365 – sinnvoll zu nutzen ist. Das geht nur, indem Outlook durch ein anderes, offenes Programm ersetzt wird. Hier sind webbasierte Applikationen eine beliebte Möglichkeit. Auf Smartphones sind diese schon heute nicht mehr wegzudenken. Auch Softwarehersteller ziehen es immer öfter vor, ihre eigene Applikation als Widget in webbasierte Applikationen zu integrieren, anstatt Plugins für spezifische Programme zu entwickeln und zu pflegen. Das minimiert Abhängigkeiten und vereinfacht die Integration in eine Vielzahl von Programmen, wovon nicht nur die Anbieter selbst, sondern auch die Anwender profitieren.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":29,"public_name":"Michael Kromer"}],"links":[],"attachments":[]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/15.html","id":15,"guid":"a6f503a4-2912-4d78-b76b-b65bc90b062d","logo":null,"date":"2018-04-21T16:15:00+02:00","start":"16:15","duration":"00:45","room":"Raum B","slug":"LIT2018-15-qgis_-_arbeiten_mit_geodaten","title":"QGIS - Arbeiten mit Geodaten ","subtitle":"","track":"Digitale Gesellschaft","type":"lecture","language":"de","abstract":"QGIS ist unter den OpenSource Geoinformationssystemen der absolute Vorreiter und entwickelt sich dynamisch weiter. \r\nDer Vortrag zeigt in einer kurzen Präsentation die vielfältigen Anwendungsmöglichkeiten von Geoinformationssystemen. Danach schließt sich ein kurzes Tutorial an, wie sich Daten, welche man selbst generiert hat (zum Beispiel Postleitzahlen von Kunden) in QGIS verarbeiten und kartographisch darstellen lassen.\r\n","description":"","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":17,"public_name":"Matthias Köppel"}],"links":[],"attachments":[]}],"Raum C":[{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/1.html","id":1,"guid":"27ec21b5-87b2-4691-9fe2-4b8ac0f6b2c7","logo":null,"date":"2018-04-21T10:45:00+02:00","start":"10:45","duration":"00:45","room":"Raum C","slug":"LIT2018-1-wie_lerne_ich_richtig_eine_programmiersprache","title":"Wie lerne ich richtig eine Programmiersprache?","subtitle":"","track":"Programmieren und Software entwickeln","type":"lecture","language":"de","abstract":"Wie lerne ich eine Programmiersprache wenn ich davor noch nie programmiert habe oder wie bringe ich mir eine neue Programmiersprache am besten bei.","description":"Eine neue Sprache lernt man, indem man Vokabeln lernt und die Grammatik in Gesprächen anwendet. Aber wie lernt man eine Programmiersprache?\r\n\r\nDieser Vortrag soll aufzeigen, wie einfach es eigentlich sein kann, eine Programmiersprache zu lernen. Dazu wird erklärt, wie die richtige Programmiersprache für den richtigen Zweck ausgewählt wird und wie diese Programmiersprache erlernt werden kann. \r\nAber beim lernen einer Programmiersprache, geht es nicht nur um das reine lernen der Sprache, sondern auch um Themen wie unter anderem sauberen Code zu schreiben.\r\n\r\nDieser Vortrag ist aber nicht nur für Anfänger gedacht, sondern auch für jene, die bereits Programmiererfahrung haben und sich eine neue Programmiersprache aneignen wollen.\r\n","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":6,"public_name":"Christian Loritz"}],"links":[],"attachments":[{"url":"/system/event_attachments/attachments/000/000/014/original/vortrag.pdf?1546163262","title":"Slides"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/21.html","id":21,"guid":"5e6cc63a-f80b-4a1f-93cb-b821a92900c4","logo":null,"date":"2018-04-21T11:45:00+02:00","start":"11:45","duration":"00:45","room":"Raum C","slug":"LIT2018-21-python_im_unterricht","title":"Python im Unterricht","subtitle":"","track":"Programmieren und Software entwickeln","type":"lecture","language":"de","abstract":"\u003ca href=\"https://www.python.org/\"\u003ePython\u003c/a\u003e ist nicht nur eine zunehmend populäre Programmiersprache, sondern auch sehr gut für den computergestützten Unterricht in Schule und Universität geeignet. Hierzu trägt nicht nur bei, dass Python relativ leicht erlernbar ist und von umfangreichen, frei verfügbaren Programmbibliotheken ergänzt wird. Einen wesentlichen Beitrag zur Verwendung im Unterricht leistet auch das \u003ca href=\"http://jupyter.org/\"\u003eJupter Notebook\u003c/a\u003e, das in verschiedener Weise gewinnbringend eingesetzt werden kann. Ein Beispiel ist die \u003ca href=\"https://github.com/jupyter/nbgrader\"\u003enbgrader\u003c/a\u003e-Erweiterung, die es erlaubt, von Schülern oder Studierenden bearbeitete Übungsaufgaben automatisiert zu korrigieren. Im Vortrag wird am Beispiel von Python und seinem Ökosystem gezeigt, wie freie Software im Unterricht genutzt werden kann.","description":"","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":24,"public_name":"Gert-Ludwig Ingold"}],"links":[{"url":"https://github.com/gertingold/lit2018","title":"Git repository zum Vortrag"}],"attachments":[{"url":"/system/event_attachments/attachments/000/000/006/original/lit2018.pdf?1546163258","title":"Vortrag (PDF)"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/20.html","id":20,"guid":"0069522b-f56d-43c1-8191-5a78dadaa292","logo":"/system/events/logos/000/000/020/large/STP_1.1.0.png?1546163252","date":"2018-04-21T13:15:00+02:00","start":"13:15","duration":"00:45","room":"Raum C","slug":"LIT2018-20-systemtestportal","title":"SystemTestPortal","subtitle":"Eine Webanwendung für den manuellen Systemtest","track":"Programmieren und Software entwickeln","type":"lecture","language":"de","abstract":"Durch Test-Automatisierung lässt sich zwar viel Testaufwand sparen, aber manuelle Systemtests sind für die Erkennung unerwarteter Fehler oft besser und daher eine sinnvolle Ergänzung.\r\nDie von uns entwickelte Webanwendung \"SystemTestPortal\" erlaubt es Entwicklern, Testern, Test-Managern und Endanwendern mühelos beim Test von Systemen zusammenarbeiten.\r\nDas System ist in Golang implementiert, sehr leichtgewichtig und unter der GPLv3 verfügbar.\r\nIm Vortrag wollen wir anhand praxisnaher Szenarien demonstrieren, wie der Einsatz des Systems zu einer Verbesserung in der Entwicklung freier Software beitragen kann.\r\n","description":"Die Automatisierung von Tests ist in nahezu jedem Softwareprojekt wünschenswert und kann erheblich zur Reduzierung von Testaufwänden und damit zur Steigerung der Produktqualität beitragen.\r\nLeider lassen sich nicht alle Tests gut automatisieren - beispielsweise dann, wenn Software in Zusammenspiel mit Hardware oder der Umgebung getestet werden soll.\r\nDaneben decken manuelle Tests häufig unerwartete Fehler auf, da Menschen diesbezüglich sensibler sind als Maschinen.\r\nDeshalb führen heutzutage praktisch alle Software-Entwickler neben automatisierten Tests auch manuelle Tests durch.\r\n\r\nLeider werden manuelle Tests häufig unsystematisch, ohne vorherige Planung und ohne vernünftige Dokumentation durchgeführt.\r\nDadurch ist für spätere Nutzer einer Anwendung nicht klar, welche Funktionen der Software mit welchem Ergebnis getestet wurden.\r\nAls Ursache sehen wir hier den Mangel an guten Werkzeugen.\r\n\r\nAm Institut für Softwaretechnologie entwickeln wir eine leichtgewichtige Webanwendung namens \"SystemTestPortal\".\r\nDie Anwendung erlaubt das Erstellen, Ausführen und Analysieren manueller Systemtests.\r\nSie hat das Ziel, gleichwohl für Entwickler, Tester, Test-Manager und auch Endanwender nützlich zu sein.\r\nSystemTestPortal wurde im Rahmen eines studentischen Projekts in Golang implementiert und ist unter der GPLv3-Lizenz verfügbar.\r\n\r\nIn dem Vortrag wollen wir zunächst die Idee hinter dem Projekt vorstellen.\r\nAnschließend wollen wir anhand praxisnaher Szenarien demonstrieren, wie der Einsatz des SystemTestPortals zu einer Verbesserung in der Entwicklung freier Software beitragen kann.\r\nZum Schluss wollen wir vom aktuellen Entwicklungsstand berichten und aufzeigen, wohin die Reise in der für den Herbst geplanten Version 2 gehen soll.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":15,"public_name":"Daniel Kulesz"},{"id":23,"public_name":"Markus Haug"},{"id":22,"public_name":"Peter Werner"}],"links":[{"url":"https://fosdem.org/2018/schedule/event/systemtestportal/","title":"Beitrag von der FOSDEM 2018"},{"url":"http://www.systemtestportal.org","title":"Homepage"},{"url":"https://gitlab.com/stp-team/systemtestportal-webapp","title":"Repository, Issue-Tracker etc."}],"attachments":[{"url":"/system/event_attachments/attachments/000/000/008/original/stp_lit2018.pdf?1546163258","title":"Vortragsfolien"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/26.html","id":26,"guid":"f5c2d84d-ca10-4ec7-8757-34ce1224494b","logo":"/system/events/logos/000/000/026/large/MixedMode_Logo_CMYK.jpg?1546163254","date":"2018-04-21T14:15:00+02:00","start":"14:15","duration":"00:45","room":"Raum C","slug":"LIT2018-26-nightly_build_grundlagen_automatisierter_builds","title":"Nightly Build: Grundlagen automatisierter Builds","subtitle":"","track":"Programmieren und Software entwickeln","type":"lecture","language":"de","abstract":"In diesem Vortrag werden die Grundprinzipien des Nightly Build sowie dessen Sinn und Zweck erläutert. Anhand eines Beispiels wird gezeigt, wie man mit Hilfe des Jenkins Build-Servers einen Nightly Build realisiert.","description":"Gerade bei größeren Softwareprojekten mit mehreren Entwicklern kommt es oft vor, dass die Weiterentwicklung des Projekts durch Dateien, die nicht in das Repository eingepflegt sind, erschwert wird oder sich das Projekt durch anderweitige Eingriffe nicht mehr erstellen lässt.\r\nNightly Build als Vorstufe der Continuous Integration sichert durch täglich nachts durchgeführte Erstellung von Projekten die stete Verfügbarkeit einer prinzipiell lauffähigen Software.\r\nIn diesem Vortrag werden die Grundprinzipien des Nightly Build sowie dessen Sinn und Zweck erläutert. Anhand eines Beispiels wird gezeigt, wie man mit Hilfe des Jenkins Build-Servers einen Nightly Build realisiert.\r\nAGENDA \r\n•\tEinführung\r\n•\tBegriffsklärungen\r\n•\tNightly Build\r\no\tBenefit\r\no\tFunktionsweise\r\no\tVoraussetzungen\r\n•\tÜbersicht über aktuelle Tools","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":37,"public_name":"Robert Wimmer"}],"links":[],"attachments":[]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/17.html","id":17,"guid":"c87b384c-f837-452b-81c9-681dcad5eff9","logo":null,"date":"2018-04-21T15:15:00+02:00","start":"15:15","duration":"00:45","room":"Raum C","slug":"LIT2018-17-manage_over_200_linux_server_with_open_source_tools","title":"Manage over 200 Linux server with open source tools","subtitle":"","track":"Linux-Interna und Anwendungen","type":"lecture","language":"de","abstract":"Wir gegen einen Überblick wie wir über 200 Server vollautomatisiert und umfangreicher Konfiguration mit OpenSource Tools verwalten. OpenSource Werkzeuge sind der Schlüssel zum Erfolg und ermöglichen umfangreiche Automatisierung und Skalierung.","description":"In diesem Vortrag werden wir einen Überblick geben über unterschiedliche OpenSource Tools die zur Administration und Automatisierung von einer umfangreichen Linux (und BSD) Serverinfrastruktur hilfreich sind. Dabei spielen Automatisierung, Konfigurationsmanagement (z.B. Puppet), Monitoring (Icinga) aber auch essentielle Komponenten wie z.B. Webserver (Nginx, Apache), Dateisysteme (glusterfs) sowie Virtualisierungstools (KVM,libvirt) eine entscheidende Rolle.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":2,"public_name":"Andreas Herz"}],"links":[],"attachments":[]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/33.html","id":33,"guid":"3d4c6fe5-b4b1-4340-ac62-5b3ab3528ec1","logo":null,"date":"2018-04-21T16:15:00+02:00","start":"16:15","duration":"00:45","room":"Raum C","slug":"LIT2018-33-lora_und_the_things_network","title":"Lora und The Things Network","subtitle":"Das \"Internet of Things\" ist nun auch in Augsburg angekommen.","track":"Programmieren und Software entwickeln","type":"lecture","language":"de","abstract":"Der Vortrag stellt die Long-Range (LoRa) Funktechnologie vor, die zur\r\nKategorie der Low Power Wide Area Technologien (LPWAN) gehört. Ausserdem wird das \"Thethingsnetwork\" LoRaWAN Gateway erläutert, das seit Februar 2018 an der Hochschule betrieben wird. Es besteht aus einem Raspberry-Pi, einem LoRa Konzentrator und freier Linux Software. ","description":"Der Vortrag stellt die Long-Range (LoRa) Funktechnologie vor, die zur\r\nKategorie der Low Power Wide Area Technologien (LPWAN) gehört. Mit LoRaWAN existiert ein MAC Protokoll mit dem sich Wide Area Networks\r\nrealisieren lassen. Eine mögliche WAN Implementierung stellt das \"The Things Network\" [1] dar, das zur Zeit etwa 3300 Gateways weltweit umfasst. Das erste \r\nGateway im Augsburger Raum läuft an der Hochschule Augsburg seit Februar 2018 (siehe die Weltkarte unter [1]). Das preiswerte Gateway besteht aus einem Raspberry-Pi, einem LoRa Konzentrator und freier Linux Software. Der Vortrag \r\ngeht auf die Konstruktion des Gateway, auf eine Beispielanwendung und auf erste (erfreuliche) Reichweitenmessungen ein. Vielleicht entschliessen sich manche Zuhörer, selber solche Gateways zu betreiben, um die Funkabdeckung im Augsburger Raum zu erhöhen. \r\n\r\n[1] https://www.thethingsnetwork.org","recording_license":"","do_not_record":false,"persons":[{"id":32,"public_name":"Hubert Högl"}],"links":[],"attachments":[{"url":"/system/event_attachments/attachments/000/000/009/original/lit2018-hoegl.pdf?1546163258","title":"Foliensatz"},{"url":"/attachments/original/missing.png","title":"Datei"}]}],"Raum D":[{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/37.html","id":37,"guid":"8614f516-35cd-41bb-b79b-00bb617a2e55","logo":null,"date":"2018-04-21T10:45:00+02:00","start":"10:45","duration":"00:45","room":"Raum D","slug":"LIT2018-37-sichere_netzwerke_mit_pfsense","title":"Sichere Netzwerke mit pfSense","subtitle":"","track":"Linux-Interna und Anwendungen","type":"lecture","language":"de","abstract":"pfSense ist eine auf FreeSD basierende Open Source Firewall/Router Software. Dieser Vortrag beschäftigt sich mit den Möglichkeiten von pfsense und der Frage warum man sich mit den umfangreichen Fähigkeiten beschäftigen sollte. ","description":"Firewalls  und Sicherheit gehören zum IT-Alltag (oder sollten es zumindestens). Bei den Anforderungen an eine solche Komponenten sollte man sich nicht nur auf die Internet Provider oder den Herstellernamen verlassen.\r\n\r\nThe pfSense Firewall ist eine high performance Firewall für den wachsenden Bedarf an diese wichtige Netzwerkkomponenten. Sie verfügt auch über weitere Funktionen wie VPNs, Ausfallsicherheit, Traffic Shapping oder IDS die sonst eher den teuren Enterprise Produkten vorbehalten sind. \r\n\r\nDenn auch ohne umfangreiche Investitionen lassen sich viele unternehmenstypische Anforderungen auch für kleine Unternehmen oder den gehobenen Heimarbeitsplatz implementieren. \r\n\r\nDieser Vortrag soll die Basisinformationen aufzeigen und erläutern welche komplexeren Aufgaben ohne grosse Investitionen bewältigen werden können. ","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":35,"public_name":"Hagen Bauer"}],"links":[],"attachments":[]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/41.html","id":41,"guid":"31fdd4a7-09ac-46fe-8ad2-5a3a0b485677","logo":null,"date":"2018-04-21T11:45:00+02:00","start":"11:45","duration":"00:45","room":"Raum D","slug":"LIT2018-41-lightning_talks","title":"Lightning Talks","subtitle":"","track":null,"type":"lecture","language":"","abstract":"Bunt gemische fünfminütige Kurzvorträge zu \u003ca href=\"https://etherpad.wikimedia.org/p/lit2018-lightning-talks\"\u003ediversen Themen\u003c/a\u003e.\r\n\r\nNoch sind Einreichungen möglich! Bitte einfach auf dem verlinkten Etherpad ergänzen.","description":"","recording_license":"","do_not_record":false,"persons":[],"links":[],"attachments":[{"url":"/attachments/original/missing.png","title":"Gib's hier LAN - RasPi als Internet-Router"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/38.html","id":38,"guid":"9232170c-e85d-46b8-815b-fa690f137874","logo":null,"date":"2018-04-21T13:15:00+02:00","start":"13:15","duration":"00:45","room":"Raum D","slug":"LIT2018-38-sochack_-_wie_voll_ist_der_akku_meines_autos","title":"SoChack - Wie voll ist der Akku meines Autos?","subtitle":"Der Raspberry Pi als Gateway für mein E-Auto","track":"Programmieren und Software entwickeln","type":"lecture","language":"de","abstract":"Im Mai 2017 haben wir unseren Diesel abgegeben und sind auf den Hyundai IONIQ umgestiegen. Leider bietet Hyundai bis heute keine App in Europa an, mit der man aus der Ferne den Ladestand checken kann. Diese fehlende Funktion habe ich mir mit dem Raspberry Pi nachgebaut.","description":"","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":28,"public_name":"Tobias Nitschmann"}],"links":[{"url":"http://sochack.eu","title":"Website des Projekts"}],"attachments":[{"url":"/system/event_attachments/attachments/000/000/013/original/LUGA_Vortrag_-_SoChack.pdf?1546163259","title":"Keynote"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/36.html","id":36,"guid":"fe629524-442c-4cfb-bbe7-65bc2a616737","logo":null,"date":"2018-04-21T14:15:00+02:00","start":"14:15","duration":"00:45","room":"Raum D","slug":"LIT2018-36-die_neue_europaische_datenschutzgrundverordnung_dsgvo","title":"Die neue europäische Datenschutzgrundverordnung DSGVO","subtitle":"Meine Rechte als Betroffener","track":"Digitale Gesellschaft","type":"lecture","language":"de","abstract":"Als Einstieg ein krasses aktuelles Reallife- Ownbody-Beispiel aus dem Personaldienstleistungsbereich, was so alles \"passiert\".\r\n\r\nRelevante Änderungen durch die DSGVO\r\n\r\nWelche Rechte habe ich als sog. Betroffene\r\nErweiterte Auskunfts- und Widerspruchsrechte\r\nRecht auf Vergessen\r\n","description":"","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":34,"public_name":"Bernhard Rietzl"}],"links":[],"attachments":[{"url":"/system/event_attachments/attachments/000/000/029/original/DSGVO_Vortrag_Lit.pdf?1546163263","title":"Vortragsfolien"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/34.html","id":34,"guid":"73eca1eb-e43c-42d9-b8e5-1320be37878f","logo":"/system/events/logos/000/000/034/large/Screenshot_at_2018-03-11_21-51-34.png?1546163256","date":"2018-04-21T15:15:00+02:00","start":"15:15","duration":"00:45","room":"Raum D","slug":"LIT2018-34-wawision_vom_hardwarehersteller_zur_erp_firma_mit_einer_open-source_version","title":"WaWision: Vom Hardwarehersteller zur ERP Firma mit einer Open-Source Version","subtitle":"","track":"Digitale Gesellschaft","type":"lecture","language":"de","abstract":"Die besten Geschichten schreibt das Leben wohl selber. In dem Vortrag berichte ich wie wir von einem Hardware-Hersteller zu einem Softwarehersteller mit mittlerweile 15 Mitarbeitern für ein Warenwirtschaftssystem geworden sind. Begonnen hat alles mit einer Open-Source Version aus unserer Eigenentwicklung.\r\n\r\nDas Geschäftsmodelle mit Open-Source funktionieren ist ja bekannt. Aber wenn man damit selber startet hat man natürlich viele Bedenkenträger und Skeptiker.\r\n\r\nDaher werde ich von unserem Werdegang als Erfahrungsbericht erzählen. Vom Auswahl der passenden Lizenz,  Aufbau der Struktur  und welche Aufgaben noch gemacht werden mussten.\r\n\r\nDer Vortrag soll einmal einem die Angst nehmen ein Modell basierend auf Open-Source aufzubauen und Anregungen geben wie man selber so ein Geschäftsmodell aufbauen könnte.\r\n","description":"","recording_license":"","do_not_record":false,"persons":[{"id":31,"public_name":"Benedikt Sauter"}],"links":[],"attachments":[{"url":"/system/event_attachments/attachments/000/000/019/original/Open-Source_Gesch%C3%A4ftsmodell_am_Beispiel_WaWision.pdf?1546163262","title":"Open-Source_Geschäftsmodell_am_Beispiel_WaWision.pdf"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/35.html","id":35,"guid":"0aba4310-78f4-4350-a867-e02a6b82c45a","logo":"/system/events/logos/000/000/035/large/SCHINFO-Sticker-klein.jpg?1546163256","date":"2018-04-21T16:15:00+02:00","start":"16:15","duration":"00:45","room":"Raum D","slug":"LIT2018-35-2_4_ghz_wlan_ganz_sicher_unsicher","title":"2.4 GHz WLAN – ganz sicher unsicher!","subtitle":"SCHINFO is coming ... WiFi is going!","track":"Privatsphäre und Sicherheit","type":"lecture","language":"de","abstract":"WLAN im 2.4 GHz-Bereich ist absolut unsicher hinsichtlich Sabotage-Angriffen. Mit einfacher Hardware und der entsprechenden Software lässt sich fast jedes WLAN deaktivieren. Ich zeige, wie man das eigene WLAN testen kann, Angriffe erkennt und welche Schutzmöglichkeiten es gibt.\r\nDer IEEE 802.11 Standard für WLAN weist einen sehr kritischen Design-Fehler auf. Über unprotected Management-Frames lassen sich AccessPoints mit einfachen Mitteln dahingehend manipulieren, dass sie alle bestehenden Verbindungen dauerhaft trennen. Dies geschieht über Deauthentication-Frames, die der AccessPoint akzeptiert und ausführt. Der verbesserte Standard IEEE 802.11w-2009, welcher dies verhindern würde, hat sich leider bis jetzt nicht durchgesetzt. Ein Schutz lässt sich aber auch über die Firmware realisieren, indem entsprechende Frames nicht ausgeführt werden.","description":"2.4 GHz WLAN - ganz sicher unsicher\r\n\r\nIEEE 802.11 öffnet für Saboteure Tür und Tor\r\n\r\nWLAN im 2.4 GHz-Bereich ist absolut unsicher, hinsichtlich Sabotage-Angriffen.\r\nMit einfacher Hardware, auf Basis des IoT-Device ESP8266, und der entsprechenden Software lässt sich fast jedes WLAN deaktivieren.\r\nDies ist ebenfalls, jedoch mit höherem Hardware-Aufwand, mit der Aircrack-NG Suite möglich.\r\nAuch bestimmte Smartphones, z.B. das Google Nexus 5, bieten (nach entsprechender Modifikation) diese Möglichkeit.\r\nIch zeige, wie man das eigene WLAN diesbezüglich testen kann, Angriffe erkennt und welche Schutzmöglichkeiten es gibt.\r\nEntsprechende, einfache und kostengünstige Hardware wird vorgestellt und erklärt.\r\n\r\n\r\nTechnischer Hintergrund:\r\n\r\nDer IEEE 802.11 Standard für WLAN weist einen sehr kritischen Design-Fehler auf.\r\nÜber Management-Frames, die unverschlüsselt akzeptiert werden, lassen sich AccessPoints mit einfachen Mitteln beispielsweise dahingehend manipulieren, dass sie alle bestehenden Verbindungen dauerhaft trennen.\r\nDer entstehende Schaden für ein Unternehmen kann bei einem Angriff mit Ausfall des WLAN in sehr extreme Höhen gehen (z. B. bis zu 1000 Euro pro Sekunde in einem bekannten Industrieunternehmen !!!)\r\nDies geschieht über Deauthentication-Frames, die der AccessPoint akzeptiert und ausführt.\r\nDer verbesserte Standard IEEE 802.11w-2009, welcher dies verhindern würde, hat sich leider bis jetzt nicht durchgesetzt.\r\nEin Schutz ließe sich aber auch über die Firmware realisieren, indem einfach entsprechende Frames nicht mehr ausgeführt werden.\r\nHierzu muss gegenüber den Hardware-Herstellern ein entsprechender Druck aufgebaut werden, dass sie ihre Firmware dafür modifizieren. Dies ist bisher leider bei fast allen Herstellern bis jetzt nicht der Fall, sodass dieses Angriffsszenario akut ist und die Gefahr nach wie vor besteht.\r\nDass eine einfache Änderung in der Firmware möglich ist, zeigt beispielsweise der Chinesische Hersteller JCG. Dort ist eine Möglichkeit auf entsprechende Management-Frames zu reagieren vorhanden.\r\n\r\nIm Vortrag wird das Problem aufgezeigt, erklärt und praktisch mit einer Testumgebung anschaulich demonstriert.\r\n\r\nDie verfügbare Hardware (ESP8266) wird vorgestellt und die verschiedenen Angriffsmöglichkeiten gezeigt.\r\nSo war es bis jetzt nicht möglich, den Störer zu lokalisieren.\r\nEs konnte nur erkannt werden, dass eine DeAuth-Angriff erfolgt. Die dazu verfügbare Hardware wird gezeigt.\r\n\r\nDie \"offizielle Version\" ist über https://github.com/spacehuhn/esp8266_deauther verfügbar und dient zum Testen des eigenen WLAN.\r\nSie wurde von Stefan Kremser, mit dem ich zusammen arbeite, entwickelt.\r\n\r\nDie \"böse Version\", mit der alle in Reichweite befindlichen WLAN-Verbindungen dauerhaft und ständig getrennt werden, wird nur gezeigt. Sie wird jedoch nicht zur Verfügung gestellt.\r\n\r\nJeder Teilnehmer am Vortrag kann sich mit dem Testnetz verbinden und sieht, dass er nach einem Angriff keine Möglichkeit mehr hat, dauerhaft mit dem Test-WLAN zu verbunden zu bleiben.\r\n\r\nDer Vortrag wird in Deutsch gehalten, Fragen können aber auch in Englisch gestellt und beantwortet werden.\r\n\r\nAktueller Update:\r\nAm 23.02.2018 ist es mir gelungen, mit einem ESP32 eine einfache Möglichkeit der Deauther-Lokalisierung zu realisieren.\r\nSie befindet sich aber noch in der Entwicklung. Eine erste Beta-Version existiert jedoch bereits und wird vorgeführt.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":33,"public_name":"Helmut Stult (schinfo)"}],"links":[{"url":"https://github.com/spacehuhn/esp8266_deauther","title":"GitHub (Spacehuhn)"},{"url":"https://github.com/schinfo","title":"GitHub (schinfo)"}],"attachments":[]}],"Raum E":[{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/12.html","id":12,"guid":"9e422a0c-f8f6-4fad-a0a0-d9cba11c3854","logo":"/system/events/logos/000/000/012/large/Terminal-dec-vt100.jpg?1546163250","date":"2018-04-21T10:45:00+02:00","start":"10:45","duration":"00:45","room":"Raum E","slug":"LIT2018-12-moderne_kommandozeilen_werkzeuge","title":"Moderne Kommandozeilen Werkzeuge","subtitle":"Schneller, besser, praktischer - Alternativen zu grep, ls und find","track":"Linux-Interna und Anwendungen","type":"lecture","language":"de","abstract":"ls, grep, find, ifconfig. Wir kennen sie alle und nutzen sie täglich. Dabei gäbe es mittlerweile, zum Teil bessere, Alternativen. Ein Blick auf die Kommandozeilenwerkzeuge des Jahres 2018.","description":"Linux ohne einer Kommandozeile ist wie ein Himmel ohne Sterne. Aber wie sieht es eigentlich mit den Tools aus, die wir hier verwenden?\r\nDie meisten Tools, die wir kennen und täglich verwenden, stammen entweder aus dem POSIX-Umfeld oder GNU-Userland. POSIX tools und Optionen stammen zum Teil aus 1988, und auch die Kommandozeilen-Werkzeuge aus dem GNU-Umfeld sind nicht viel moderner. Dabei gäbe es durchaus zeitgemäße Alternativen. Lasst uns gemeinsam einen Blick auf ripgrep, exa, fzf, ip und Co. werfen.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":14,"public_name":"leyrer"}],"links":[],"attachments":[{"url":"/system/event_attachments/attachments/000/000/012/original/Augsburg_Linuxtag-Moderne_Kommandozeilentools_distributable_version.pdf?1546163259","title":"Vortragsfolien"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/3.html","id":3,"guid":"d90fbe26-5fe1-4b34-bbbb-d9da22e1119d","logo":"/system/events/logos/000/000/003/large/logo.png?1546163248","date":"2018-04-21T11:45:00+02:00","start":"11:45","duration":"00:50","room":"Raum E","slug":"LIT2018-3-brig_-_dezentrale_und_sichere_dateisynchronisation","title":"»brig« - dezentrale und sichere Dateisynchronisation","subtitle":"Von Tropfenschachteln und Zweimastern","track":"Privatsphäre und Sicherheit","type":"lecture","language":"de","abstract":"»brig« ist ein freies und komplett dezentrales Werkzeug zum sicheren und einfachen Austausch und Versionieren von Dateien. Es bietet eine Reihe von Möglichkeiten, die bislang kein anderes Tool oder Plattform ermöglicht. Da »brig« an der Hochschule Augsburg entstand und weiterhin in Augsburg entwickelt wird, ist es nur konsequent den aktuellen Entwicklungsstand hier zu zeigen. \r\n\r\nDer Vortrag ist eine Projektvorstellung und zeigt das Tool selbst (samt Demo), was es noch können soll und wie man die Entwicklung unterstützen könnte.","description":"Für mehr Informationen siehe (in dieser Reihenfolge):\r\nDen Vortrag, GitHub und die Dokumentation.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":5,"public_name":"Chris Pahl"}],"links":[{"url":"http://sahib.github.io/brig/public","title":"Homepage"},{"url":"https://github.com/sahib/brig","title":"GitHub"},{"url":"http://brig.readthedocs.io/en/latest/","title":"Dokumentation"}],"attachments":[{"url":"/system/event_attachments/attachments/000/000/003/original/slides.pdf?1546163258","title":"Slides als PDF"},{"url":"/system/event_attachments/attachments/000/000/004/original/slides.html.tgz?1546163258","title":"Slides als HTML"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/25.html","id":25,"guid":"494cd9b9-ef5a-4bd5-83fe-7335391a7a90","logo":"/system/events/logos/000/000/025/large/nixos-hex.svg.small.png?1546163253","date":"2018-04-21T13:15:00+02:00","start":"13:15","duration":"00:45","room":"Raum E","slug":"LIT2018-25-nix_os_package-management_done_right","title":"Nix(OS): Package-management done right","subtitle":"","track":"Linux-Interna und Anwendungen","type":"lecture","language":"de","abstract":"\u003cp\u003eNix wird als der „Retter der Paketverwaltung“ gehandelt. Was da dran ist, wie es funktioniert und was man damit machen kann (z.B. eine komplette Distribution!), darum geht es in diesem Talk.\u003c/p\u003e\r\n","description":"\u003cp\u003eNix wird als der „Retter der Paketverwaltung“ gehandelt. Was da dran ist, wie es funktioniert und was man damit machen kann (z.B. eine komplette Distribution!), darum geht es in diesem Talk.\u003c/p\u003e\r\n\r\n\u003cp\u003eIch zeige den \u003cem\u003eNix Paketmanager\u003c/em\u003e, die \u003cem\u003eNix Konfigurationssprache\u003c/em\u003e und das \u003cem\u003eNixOS Betriebssystem\u003c/em\u003e. Am Schluss gibt es einen Ausblick auf Deployment mit \u003cem\u003eNixOPs\u003c/em\u003e und den Bau von \u003cem\u003eDocker-Images\u003cem\u003e.\u003c/p\u003e","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":27,"public_name":"Profpatsch"}],"links":[{"url":"https://www.meetup.com/Munich-NixOS-Meetup","title":"Meetup-Gruppe München"},{"url":"https://nixos.org/nix","title":"Nix Paketmanager"},{"url":"https://nixos.org","title":"NixOS Distribution"},{"url":"http://curry-club-augsburg.de/","title":"Curry Club Augsburg"},{"url":"http://profpatsch.de/talks/nix/nixos-package-management-done-right-DE/p/HkdVNYZdb.html#/","title":"Vortragsfolien"}],"attachments":[]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/28.html","id":28,"guid":"473dc2e7-0a5c-4741-bdb2-5202cac65e4c","logo":"/system/events/logos/000/000/028/large/tux_in_a_box_by_mawscm-d2zmvpe.png?1546163254","date":"2018-04-21T14:15:00+02:00","start":"14:15","duration":"00:45","room":"Raum E","slug":"LIT2018-28-linux_container_ein_einstieg","title":"Linux Container: Ein Einstieg","subtitle":"Das was und warum von Docker und co.","track":"Linux-Interna und Anwendungen","type":"lecture","language":"de","abstract":"Dieser Vortrag gibt einen Einblick in die Welt von Docker und anderen Linux Container Systemen bieten. Wir befassen uns kurz mit der Geschichte von Containerisation auf Linux und anderen Plattformen, welchen Nutzen diese Techniken stiften und wie sie auf Linux funktionieren. Anschließend darauf ein, welche Rolle Docker und Kubernetes heute spielen und warum sie immer beliebter werden. Das Ende ist offen für Fragen und/oder je nach Zeit ein paar live Demos mit Docker.","description":"","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":3,"public_name":"Anian Ziegler"}],"links":[],"attachments":[{"url":"/system/event_attachments/attachments/000/000/017/original/presentation.pdf?1546163262","title":"Presentation"},{"url":"/system/event_attachments/attachments/000/000/018/original/short-notes.md?1546163262","title":"Notizen"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/32.html","id":32,"guid":"f6ee2de7-d18e-4762-b0a2-184e75c8a687","logo":null,"date":"2018-04-21T15:15:00+02:00","start":"15:15","duration":"00:45","room":"Raum E","slug":"LIT2018-32-der_einsatz_von_docker_in_entwicklungs-_und_production-umgebungen","title":"Der Einsatz von Docker in Entwicklungs- und Production-Umgebungen","subtitle":"","track":"Linux-Interna und Anwendungen","type":"lecture","language":"de","abstract":"Während der vergangenen 12 Monate haben wir unsere Entwicklungs- und Production-Umgebungen auf Docker umgestellt. Ziel war es, dem gesamten Team sowohl auf Mac als auch auf Windows identische Setups und Software Versionen (Betriebssystem, PHP, OXID, MySQL, Ontraq Module etc.) zur Verfügung zu stellen. Inzwischen haben wir auch damit begonnen, die Production-Umgebungen unserer Kunden von physikalischen Servern unter Verwendung von Docker Swarms auf skalierbare Setups umzustellen. Dieser Vortrag soll anhand von Beispielen darstellen, was wir im Laufe dieses Prozesses gelernt haben.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":30,"public_name":"Chris Jolly"}],"links":[],"attachments":[{"url":"/system/event_attachments/attachments/000/000/023/original/Docker_Introduction_21.04.2018.pdf?1546163263","title":"Vortragsfolien"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/13.html","id":13,"guid":"21c84d6c-0fce-491a-ad8f-c51b17aa7aa4","logo":"/system/events/logos/000/000/013/large/Freifunk.net.svg.png?1546163250","date":"2018-04-21T16:15:00+02:00","start":"16:15","duration":"00:45","room":"Raum E","slug":"LIT2018-13-freifunk","title":"Freifunk","subtitle":"Eine Übersicht über das Thema und den aktuellen Stand.","track":"Digitale Gesellschaft","type":"lecture","language":"de","abstract":"Freifunk ist eine Bewegung dezentrale Bürger(mesh)netz mit WLAN-Routern zu schaffen, bei der jeder mitmachen kann. Wir wollen zeigen worum es geht, wo Freifunk z.Z. steht und wo es hingehen könnte.","description":"","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":16,"public_name":"Moritz Warning"}],"links":[],"attachments":[{"url":"/system/event_attachments/attachments/000/000/021/original/freifunk_linux_info_tag_2018.pdf?1546163263","title":"Vortragsfolien PDF"},{"url":"/system/event_attachments/attachments/000/000/026/original/freifunk_linux_info_tag_2018.odp?1546163263","title":"Vortragsfolien ODP"}]}],"Raum F":[{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/24.html","id":24,"guid":"c1f9aac2-cfe9-4a10-85e5-549c3e8d6e68","logo":"/system/events/logos/000/000/024/large/icon.jpeg?1546163253","date":"2018-04-21T10:45:00+02:00","start":"10:45","duration":"01:45","room":"Raum F","slug":"LIT2018-24-linux_kernel_programmierung","title":"Linux Kernel Programmierung","subtitle":"Grundwissen und Beispiele","track":null,"type":"workshop","language":"de","abstract":"","description":"\u003cp\u003eDer Workshop wird aus zwei Teilen bestehen und ca. 2 Stunden (mit 30 min Zeitpuffer für optionale Vertiefungen und Fragen) dauern:\u003c/p\u003e\r\n\r\n\u003ch2\u003e1. Teil Hintergrundwissen\u003c/h2\u003e\r\n\r\n\u003cp\u003eIm ersten Teil möchte ich die Grundlagen an Hintergrundwissen und Konzepten zu Linux Kernelprogrammierung\r\nnahebringen. Vieles davon ist angenehmerweiße auch für die Kernel und Treiberentwicklung unter anderen\r\nSystemen wie macOS, BSD und Windows NT gültig. Dazu gehören:\u003c/p\u003e\r\n\r\n\u003cul\u003e\r\n\u003cli\u003eAusführungskontexte (Process Context vs. Interrupt Context)\r\nund deren Bedeutung + Implikationen\u003c/li\u003e\r\n\u003cli\u003eInterrupt Handler Konzepte (Top Half und Bottom Half, ISR, Interrupt Lines)\u003c/li\u003e\r\n\u003cli\u003eBottom Half Varianten (Work Queeus, Tasklets, SoftIRQs)\u003c/li\u003e\r\n\u003cli\u003eKernelthreads\u003c/li\u003e\r\n\u003cli\u003eContext Switches\u003c/li\u003e\r\n\u003cli\u003eMemory Managment\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\n\u003ch2\u003e2. Teil: Anwendung: Beispiele, Quellcode Erforschen\u003c/h2\u003e\r\n\r\n\u003cp\u003eIm zweiten Teil werde ich mit euch das Wissen aus Teil 1 anwenden und ein bischen den Linux Quellcode erforschen\r\nund verstehen. Am einfachsten geht das für das Netzwerksubsystem, wir können aber auch in andere Subsysteme Abstecher machen.\r\nNeben der Methode \"Code lesen im richtigen Editor\" gibt es dafür auch noch andere praktische Wege. Dazu gehören tracing mit ftrace\r\nund weitere mächtige tracing tools aus https://github.com/iovisor/bcc mit denen man sehr gut tief in den Kernel kucken\r\nund Zusammenhänge erforschen kann. Wir werden ein paar davon ausprobieren und uns zusammen umkucken.\u003c/p\u003e\r\n\r\n\u003ch2\u003eVorbereitung\u003c/h2\u003e\r\n\r\n\u003cp\u003eEs wäre gut wenn ihr vor dem Workshop:\u003c/p\u003e\r\n\r\n\u003cul\u003e\r\n\u003cli\u003edas linux mainline repository ( git://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git ) auf euren Klapprechner clont und mitbringt.\u003c/li\u003e\r\n\u003cli\u003edas trace-cmd paket installiert\u003c/li\u003e\r\n\u003c/ul\u003e\r\n","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":26,"public_name":"richard_siegfried"}],"links":[],"attachments":[{"url":"/system/event_attachments/attachments/000/000/015/original/linux_kernel_programmierung_vortrag.pdf?1546163262","title":"Folien"}]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/39.html","id":39,"guid":"32129314-ce2a-4a80-9c63-2cdb2f102f7b","logo":null,"date":"2018-04-21T13:15:00+02:00","start":"13:15","duration":"01:45","room":"Raum F","slug":"LIT2018-39-programmier-workshop_fur_schulerinnen_und_schuler","title":"Programmier-Workshop für Schülerinnen und Schüler","subtitle":"","track":"Programm für Kinder und Jugendliche","type":"workshop","language":"","abstract":"Python ist eine moderne Programmiersprache, mit der man zum Beispiel eigene Spiele und Webseiten erstellen kann. Im Workshop unternehmen wir gemeinsam erste Schritte in dieser Sprache. Es sind keinerlei Computer- oder Programmier-Vorkenntnisse nötig.\r\n\r\nWenn du nicht genau weißt, was dich in dem Workshop erwartet, oder wenn du sonstige Fragen oder Wünsche hast, kannst du uns jederzeit informal und unverbindlich eine Mail schreiben.\r\n\r\nWenn du mindestens in die vierte Klasse gehst, bist du herzlich zu diesem Workshop eingeladen! Bring einen Laptop mit oder melde dich vorab per Mail an, wenn das nicht gehen sollte, dann kannst du einen Laptop von uns haben. Keine Sorge: Wir werden das vorhandene Laptopsystem nicht ändern. Wir werden den Laptop nur verwenden, um auf eine bestimmte Webseite zu gehen.","description":"","recording_license":"","do_not_record":false,"persons":[],"links":[],"attachments":[]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/6.html","id":6,"guid":"e501483e-70e7-4250-9e58-eab7538280c8","logo":"/system/events/logos/000/000/006/large/nodeschool-augsburg-logo.png?1546163249","date":"2018-04-21T15:15:00+02:00","start":"15:15","duration":"01:45","room":"Raum F","slug":"LIT2018-6-nodeschool","title":"Nodeschool","subtitle":"","track":"Programmieren und Software entwickeln","type":"workshop","language":"de","abstract":"Im Rahmen des Linux Info Tages wollen wir eine kleine NodeSchool anbieten. Was das ist?\r\nDu wolltest schon immer mal programmieren? Oder willst endlich mal Node.js ausprobieren? Nimm teil und lerne Programmieren mit Node.js ganz einfach - versprochen! Es hilft, wenn du schon mal etwas mit JavaScript gemacht hast - wenn nicht, komm trotzdem! Wir helfen gern.","description":"Join us and learn coding with us. You are going to learn the basics of Node.js. It's a plus if you know some JavaScript beforehand, but if not we can help you out.\r\n\r\nDu lernst mit kleinen Programmen, die du selbst schreibst - keine langweiligen Vorträge! Alle Aufgaben sind Open Source und online unter nodeschool.io verfügbar, so kannst du auch ganz einfach nach der NodeSchool selber weiter lernen.\r\n\r\nYou will go through a set of self-paced challenges. No boring talks. All challenges are Open Source and available online on nodeschool.io. This means you can continue learning after the event.","recording_license":"Creative Commons BY-SA 4.0","do_not_record":false,"persons":[{"id":8,"public_name":"Nodeschool Augsburg"}],"links":[{"url":"https://nodeschool.io/augsburg/","title":"Website Nodeschool Augsburg"}],"attachments":[]}],"Raum G":[{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/40.html","id":40,"guid":"68aaf2e3-4428-4457-ab8c-197a36fe3f2b","logo":null,"date":"2018-04-21T10:45:00+02:00","start":"10:45","duration":"01:45","room":"Raum G","slug":"LIT2018-40-eine_botschaft_an_ausserirdische","title":"Eine Botschaft an Außerirdische","subtitle":"","track":"Programm für Kinder und Jugendliche","type":"workshop","language":"","abstract":"Vor etwa 15 Jahren schickte die Menschheit eine Radiobotschaft an ausgewählte Sterne, in der Hoffnung, dass die Nachricht Außerirdische erreicht, diese die Nachricht verstehen und uns antworten. Die Nachricht ist nicht auf Deutsch oder Englisch verfasst, sondern bedient sich einer eigens entwickelten Symbolsprache. Schaffen wenigstens wir Menschen, die Botschaft zu entziffern? Das wollen wir in dem Workshop an uns selbst testen und herausfinden!\r\n\r\nKinder ab einschließlich der vierten Klasse, Jugendliche und Erwachsene können hier gleichermaßen versuchen, die Cosmic-Call-Botschaft zu entziffern. Kinder entdecken dabei spielerisch das Binärsystem, wenn sie es nicht schon kannten. Erwachsene können ihre Kenntnisse von Atommodellen aufpolieren.\r\n\r\n\u003cstrong\u003eMan kann während der gesamten Workshopzeit jederzeit kommen und gehen.\u003c/strong\u003e","description":"\u003ca href=\"https://rawgit.com/iblech/mathezirkel-kurs/master/mathecamp-2016/cosmic-call/message.pdf\"\u003e\u003cstrong\u003eDie Botschaft an Außerirdische\u003c/strong\u003e\u003c/a\u003e\r\n\u003ca href=\"https://rawgit.com/iblech/mathezirkel-kurs/master/mathecamp-2016/cosmic-call/spoiler.pdf\"\u003e\u003cstrong\u003eAuflösung von Mark Jason Dominus\u003c/strong\u003e\u003c/a\u003e\r\n\u003ca href=\"https://www.math.uni-augsburg.de/schueler/mathezirkel/materialien/beweise-ohne-worte-klein.pdf\"\u003e\u003cstrong\u003eBeweise ohne Worte\u003c/strong\u003e\u003c/a\u003e","recording_license":"","do_not_record":false,"persons":[],"links":[],"attachments":[]},{"url":"https://www.luga.de/Aktionen/LIT-2018/Programm/events/42.html","id":42,"guid":"1970f0b1-49fd-4cdd-88a5-443075c1cb87","logo":null,"date":"2018-04-21T15:15:00+02:00","start":"15:15","duration":"00:45","room":"Raum G","slug":"LIT2018-42-die_wundersame_welt_der_unendlich_grossen_zahlen_glaube_in_der_mathematik","title":"Die wundersame Welt der unendlich großen Zahlen – Glaube in der Mathematik?","subtitle":"Hat absolut nichts mit Linux, Technik oder digitaler Gesellschaft zu tun","track":null,"type":"lecture","language":"de","abstract":"\u003cstrong\u003eBei den vielen technischen und gesellschaftlichen Vorträgen Lust auf etwas ganz anderes?\u003c/strong\u003e\r\n\r\n    Liebe ist unendlich. Gott ist unendlich. Das sind vertraute     Vorstellungen, die in unserem Denken mit Unendlichkeit verknüpft     sind. Weitere, zunächst verborgene Perspektiven eröffnet die     Mathematik. \r\n\r\n    Es stellt sich nämlich heraus, dass der bekannte Zahlenstrahl nicht der Weisheit letzter Schluss ist: Nach 1, 2 und 3, nach der Million     und der Trilliarde, nach der Anzahl Sandkörner – nach all diesen     Zahlen folgen die unendlich großen Zahlen. Verblüffenderweise können     wir Menschen trotz unseres beschränkten Verstands diese unendliche     Hierachie unendlich großer Zahlen erkunden und sichere Informationen     über sie gewinnen.\r\n\r\n    Der Vortrag nimmt alle Interessierten auf eine Reise durch diese wundersame Welt der     unendlich großen Zahlen mit. Anstelle von Formeln oder Rechnungen     wird es Bilder und anschauliche Gedankenexperimente geben. Die alte    Frage, ob unendlich plus eins nun mehr sei wie unendlich oder doch    wieder nur unendlich, kann anschließend ohne jegliche    Restzweifel selbst verständlich beantwortet werden.\r\n\r\n    Die Beschäftigung mit Unendlichkeit verknüpft Mathematik mit    philosophischer Erkenntnistheorie. Eine verwandte Frage über die    Natur der Unendlichkeit ist nämlich bis heute ungeklärt und wird das    bewiesenermaßen für immer bleiben. Wie diese Frage lautet, was ihr    die moderne Mathematik zu entgegnen hat und wie man sich endgültiger    Unkennbarkeit mit mathematischer Präzision gewiss sein kann, wird    der Vortrag ebenfalls beleuchten.\r\n\r\n\u003ca href=\"https://rawgit.com/iblech/mathezirkel-kurs/master/superturingmaschinen/koenigsbrunner-campus2017.pdf\"\u003e\u003cstrong\u003eVortragsfolien\u003c/strong\u003e\u003c/a\u003e\r\n\u003ca href=\"https://www.youtube.com/watch?v=wZzn4INtbwY\u0026amp;list=PLwpepnYDFK9OxuqUvLDQPoTBEGyuj4iLU\"\u003e\u003cstrong\u003eAufzeichnung einer früheren Instanz des Vortrags\u003c/strong\u003e\u003c/a\u003e\r\n\u003ca href=\"https://www.youtube.com/watch?v=sUqwFbbwHQo\"\u003e\u003cstrong\u003eSuperturingmaschinen\u003c/strong\u003e\u003c/a\u003e","description":"","recording_license":"","do_not_record":false,"persons":[{"id":4,"public_name":"Ingo Blechschmidt"}],"links":[],"attachments":[]}]}}]}}}